app/controllers/line_items_controller.rb

SELECT  "products".* FROM "products"  WHERE "products"."id" = ? LIMIT 1  [["id", 2]]
INSERT INTO "carts" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2014-04-27 02:01:30.812505"], ["updated_at", "2014-04-27 02:01:30.812505"]]
INSERT INTO "line_items" ("cart_id", "created_at", "product_id", "updated_at") VALUES (?, ?, ?, ?)  [["cart_id", 4], ["created_at", "2014-04-27 02:01:30.888698"], ["product_id", 2], ["updated_at", "2014-04-27 02:01:30.888698"]]
UPDATE "line_items" SET "quantity" = ?, "updated_at" = ? WHERE "line_items"."id" = 6  [["quantity", 9], ["updated_at", "2014-04-27 02:01:22.236858"]]
---
  def create
    product = Product.find(params[:product_id])
    @line_item = @cart.add_product(product.id)
    respond_to do |format|

      if @line_item.save