app/controllers/orders_controller.rb

  def create
    @order = Order.new(order_params)
    @order.add_line_items_from_cart(@cart)
    respond_to do |format|
      if @order.save
        Cart.destroy(session[:cart_id])
---
INSERT INTO "orders" ("address", "created_at", "email", "name", "pay_type", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["address", "aaaa"], ["created_at", "2014-05-11 18:42:04.854665"], ["email", "aaa"], ["name", "aaa"], ["pay_type", "Credit card"], ["updated_at", "2014-05-11 18:42:04.854665"]]
DELETE FROM "carts" WHERE "carts"."id" = ?  [["id", 42]]