app/controllers/products_controller.rb

UPDATE "products" SET "description" = ?, "image_url" = ?, "price" = ?, "title" = ?, "updated_at" = ? WHERE "products"."id" = 980190962  [["description", "Wibbles are fun!"], ["image_url", "lorem.jpg"], ["price", 19.95], ["title", "Lorem Ipsum"], ["updated_at", "2014-04-27 02:02:54.428525"]]
---
  def update
    respond_to do |format|
      if @product.update(product_params)